DabbiruSunil/RTOS-based-Reaction-Game-with-Arcadian-light-effects/Generated_Source/PSoC5/Control_Seven.h
/*******************************************************************************
* File Name: Control_Seven.h  
* Version 1.80
*
* Description:
*  This file containts Control Register function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_CONTROL_REG_Control_Seven_H) /* CY_CONTROL_REG_Control_Seven_H */
#define CY_CONTROL_REG_Control_Seven_H

#include "cyfitter.h"

#if ((CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC3) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC4) || \
     (CYDEV_CHIP_FAMILY_USED == CYDEV_CHIP_FAMILY_PSOC5))
    #include "cytypes.h"
#else
    #include "syslib/cy_syslib.h"
#endif

    
/***************************************
*     Data Struct Definitions
***************************************/

/* Sleep Mode API Support */
typedef struct
{
    uint8 controlState;

} Control_Seven_BACKUP_STRUCT;


/***************************************
*         Function Prototypes 
***************************************/

void    Control_Seven_Write(uint8 control) ;
uint8   Control_Seven_Read(void) ;

void Control_Seven_SaveConfig(void) ;
void Control_Seven_RestoreConfig(void) ;
void Control_Seven_Sleep(void) ; 
void Control_Seven_Wakeup(void) ;


/***************************************
*            Registers        
***************************************/

/* Control Register */
#define Control_Seven_Control        (* (reg8 *) Control_Seven_Sync_ctrl_reg__CONTROL_REG )
#define Control_Seven_Control_PTR    (  (reg8 *) Control_Seven_Sync_ctrl_reg__CONTROL_REG )

#endif /* End CY_CONTROL_REG_Control_Seven_H */


/* [] END OF FILE */
